# 1) თქვენი სიტყვებით ახსენით თუ რაში გვჭირდება ფუნქციების გამოყენება პითონში.


# funqcias viyenebt rata gavamartivot chveni saqme da aseve radgan sjevdzlot rameshi shevinaxot mnishvneloba da gavimartivot saqme


# 2) გადახედეთ რესურსს პითონში ფუნქციების შესახებ:


# https://www.w3schools.com/python/python_functions.asp


# 3) შექმენით ფუნქცია სახელწოდებით double_values რომელიც არგუმენტად მიიღებს სიას და დააბრუნებს ახალ სიას, სადაც თითოეული ელემენტი გაორმაგებული იქნება.


def double_values(ricx):
    return [i * 2 for i in ricx]
print(double_values([1, 2, 3]))  


# 4) შექმენით ფუნქცია, რომელსაც არგუმენტად გადასცემთ სიას (ჩათვალეთ, რომ სიაში ინახება Integer-ი რიცხვები). ამ ფუნქციამ საბოლოოდ უნდა დააბრუნოს სიიდან მხოლოდ ლუწი რიცხვები.

def mxolod_luwebi(luwebi):
    return [luwi for luwi in luwebi if luwi % 2 == 0] 
print(mxolod_luwebi([2 , 3 , 5 , 6 , 7]))


# 5) შექმენით ფუნქცია და გადაეცით არგუმენტად სია. ფუნქციამ უნდა დააბრუნოს ახალი სია, რომლის თითოეული ელემენტიც უნდა იყოს კვადრატში აყვანილი.


def kvadrati(ricxvebi):
    return [num ** 2 for num in ricxvebi]
print(kvadrati([1, 2, 3]))  


# 6) შექმენით ფუნქცია და არგუმენტად გადაეცით String-ი. ფუნქციამ ეგრედწოდებულად უნდა "გაფილტროს" ეს სტრინგი თანხმოვანი ასოებისგან და მხოლოდ დააბრუნოს ის ხმოვანი ასოები, რომლებსაც ეს სტრინგი შეიცავს.


def xm(stringi):
    mxolod_xm = 'aeiouAEIOU'
    return ''.join([tanx for tanx in stringi if tanx in mxolod_xm])



# 7) შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ უარყოფითი რიცხვები.


def ua(ricxvebii) : 
    return [au for au in ricxvebii if au < 0 ]
print(ua([2 , 3 , 4 , -1 ]))


# 8) წინა დავალების ანალოგიურად შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ამ შემთხვევაში ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ დადებითი რიცხვები.


def n(ni) :
    return [ num for num in ni if num > 0]
print(n([ 2 , -2]))


# 9) შექმენით ფუნქცია და მას პარამეტრად  გადაეცით ერთი რიცხვი. ფუნქციამ უნდა დააბრუნოს ეს რიცხვი აყანილი კვადრატში და გამრავლებული 10-ზე. (ხარისხში აყვანის ოპერატორის შესახებ მოიძიეთ რესურსები, რათა გამოიყენოთ დავალებაში.)


def ayvana_gam(number):
    return (number ** 2) * 10
print(ayvana_gam(47)) 

# 10) შექმენით ფუნქცია. მას გადაეცით ორი პარამეტრი: x და y რიცხვები. ფუნქციამ უნდა დააბრუნოს x რიცხვი აყვანილი y ხარისხში.


def x(x, y):
    return x ** y
print(x(4 , 5))


