# 1) ახსენით რა განსხვავებაა index-ინგსადა სლასინგ შორის


# Indexing გამოიყენება იმისთვის, რომ სიიდან მივიღოთ მხოლოდ ერთი კონკრეტული ელემენტი მისი ინდექსის (ადგილის) მიხედვით.


# ჩამოთვალეთ ნასწავლი list-ის ფუნქციები და ახსენით რას შვება თითოეული


# append(x)	სიას ბოლოს ამატებს ელემენტს x
# insert(i, x)	სიაში კონკრეტულ ადგილას (ინდექსზე i) ამატებს ელემენტს x
# pop()	შლის და აბრუნებს ბოლო ელემენტს
# pop(i)	შლის და აბრუნებს ელემენტს კონკრეტული ინდექსით i
# index(x)	აბრუნებს ელემენტის x პირველივე ადგილს (ინდექსს) სიაში

# 3) ახსენით რა განსხვავებაა return-სა და print-ს შორის


# print()	                            return
# ეკრანზე აჩვენებს ინფორმაციას	         აბრუნებს მნიშვნელობას ფუნქციიდან
# მხოლოდ გამოსატანად გამოიყენება	   პროგრამის შიგნით შემდგომი გამოყენებისთვისაც არის
# შედეგი "ნახულია", მაგრამ ვერ ინახება	შეგვიძლია შედეგი შევინახოთ ცვლადში


# 4) ახსენით რა განსხვავებაა List-ებსადა ცვადებს შორის


# ცვლადი არის სახელწოდება, რომელსაც ვანიჭებთ მნიშვნელობას. ის ინახავს მონაცემს — მაგალითად, ერთ რიცხვს, ტექსტს, სიას და სხვას.

# სია (List) კი არის მონაცემთა კოლექცია, რომელიც ინახავს მრავალ ელემენტს ერთ ცვლადში. სიაში შეიძლება იყოს რიცხვები, სტრინგები, სხვა სიები და სხვ.