# 1)შექმენით სია, სადაც გექნებათ 10 ელემენტი, შემდეგ შეცვალეთ ბოლო ელემენტი "Aleksandre" თი და საბოლოოდ უარყოფითი ინდექსებით გამოიტანეთ ბოლო ელემენტი

a = [1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , "9" , "10" , "giorgi" ]

a[10] = "aleksandre"

print(a[-1])


# 2)კომენტარებით ახსენით რას ნიშნავს რომ string არის immutable და list არის mutable

# string aris immitable anu sheuxebeli da sheucvleli mas ver sheucvli type xolo list ki


# 3)შექმენით სია 10 ცალი რიცხვით, შემდეგ მე 5 ელემენტი შეცვალეთ 5.12 ით, და შემდეგ ეს 5.12 გამოიტანეთ ნეგატიური ინდექსებით 


b = [ 1 , 2, 3, 4, 5, 6, 7, 8 , 9 , 10 , 11]


b[4] = 5.12

print(b[-7])