# 1)კომენტარების სახით ახსენით რა არის ინდექსინგი, საიდან იწყება და როგორ ყალიბდება

# indeqsi aris listis shemadgeneli elementebi ramdeni elementicaa imdeni indexsia magram index is atvla iwyeba 0 idan


# 2)შექმენით სია 10 ცალი ელემენტით, შემდეგ მეხუთე ეელმენტი შეცალეთ 5 იანით, და გამოიტანეთ მეორე ელემენტის მერე ყველა არსებული ელემენტი ყაროფითი ინდექსების საშუალებით


a = [1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 ,10 , 11]

a[5] = 5

print(a[1 : -1])


# 3)კომენტარების სახით ახსენით რა არის slicing და რაში ვიყენებთ მას, მოიყვანეთ რამდენიმე მაგალითი


# slicing aris wra gawra viyenebt rodesac ar gvinda listida ramodenime elementi ar gvinda davprintot

b = [1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10]

print(b [4:-3 ])


# 4)შექმენით სია 80 ცალი ელემენტით, შემდეგ 65 ელემენტი შეცვალეთ "gurami" თ და გამოიტანეთ იგი უარყოფითი ინდექსებით


g = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85]


g[65] = "gurami"


print(g [ -21])
         
