# 1) გაქვს სია სახელებით: ["გიო", "ანა", "საბა"]. დაწერე კოდი, რომელიც ყველა სახელს გააერთიანებს ერთ წინადადებაში მძიმით გამოყოფილს.
name = ["გიო", "ანა", "საბა"]
gavaertianot = ", ".join(name)
print(gavaertianot)


# 2: შექმენი ცხოველების სია და დაამატე მასში "კუ". 

cx = ["mgeli" , "shveli" , "lomi"]
print(cx.append("ku"))


# 3: დაბეჭდე სიის პირველი და ბოლო წევრი.(გამოიყენე ნეგატიური ინდექსები)


print(cx[-3])
print(cx[-1])


# 4:დაწერე სტრინგი "მეგობრები" და გინდა გაიგე რამდენი ასოსა ამ სიაში. დაბეჭდე რაოდენობა


a = "megobari"
print(len(a))


# 5:დაგიწერია სია [მე,მიყვარს,გოა] და გაიგე გაიგო რამდენი ელემენტია ამ სიაში. დაბეჭდე რაოდენობა


Goa = ["მე","მიყვარს","გოა"]
print(len(Goa))

# 6: შექმენი სია შენი საყვარელი 3 სიმღერა და დაუმატე მეოთხე სიმღერა "pantera" მეორე ინდექსზე.


s = [ "new folks" , "skin" , "jizn takaia"]
s.insert(2 , "pantera")

# 7:გადააქციე ლისტი სტრინგად და დაყავი თითოეული სტრინგი ამ ელემენტით "|"


saxelebi = ["გიო", "ანა", "საბა"]
names1 = "|".join(saxelebi)


# 8 გადააკეთე სტრიქონიჯერ  დიდ ასოებად მერე პატარად და საბოლოოდ პირველ ასო გაზარდე

N = "Nuca"


print(N.upper())
print(N.lower())
print(N.capitalize())


# 9:იპოვე სიტყვა "პითონი" წინადადებაში find() ფუნქციით და დაბეჭდე მისი მდებარეობა.


P = "Python_is_good"
print(P.find("Python"))


# 10:შექმენი სია და ჩასვი "კომფეტი" მეორე პოზიციაზე insert()-ით


K = [ 1 , 2 , 3 , 4]
K.insert(1 , "komfeti")
print(K)


# 11:დაწერე ფუნქცია double(n), რომელიც იღებს რიცხვს და აბრუნებს მის ორმაგს.


def double(n) :
    return n*2
print(double(input("sheiyvane ricxvi")))


# 12:დაწერე ფუნქცია is_even(n), რომელიც აბრუნებს True თუ რიცხვი ლუწია, და False თუ კენტია.


def is_even(n) :
    if n % 2 == 0 :
        return ("luwi")
    else :
        return("kenti")
    
print(is_even(input("sheiyvane ricxvi")))